AlirezaSalehy/plNIC/Tests/PLMTest/Src/stm32f10x_plm.c
/******************** (C) COPYRIGHT 2007 STMicroelectronics ********************
* File Name          : stm32f10x_plm.c
* Author             : Systems LAB - IMS (Industrial & Multisegment Sector)
* Date First Issued  : 14/06/2012
* Description        : PLM peripheral routines
********************************************************************************
* History:
* 14/06/2012: V0.1
********************************************************************************
* THE PRESENT SOFTWARE WHICH IS FOR GUIDANCE ONLY AIMS AT PROVIDING CUSTOMERS
* WITH CODING INFORMATION REGARDING THEIR PRODUCTS IN ORDER FOR THEM TO SAVE TIME.
* AS A RESULT, STMICROELECTRONICS SHALL NOT BE HELD LIABLE FOR ANY DIRECT,
* INDIRECT OR CONSEQUENTIAL DAMAGES WITH RESPECT TO ANY CLAIMS ARISING FROM THE
* CONTENT OF SUCH SOFTWARE AND/OR THE USE MADE BY CUSTOMERS OF THE CODING
* INFORMATION CONTAINED HEREIN IN CONNECTION WITH THEIR PRODUCTS.
*******************************************************************************/

#define ___USE_PLM_REDEF___

/* Includes ------------------------------------------------------------------*/
#include "stm32f10x_plm.h"

/* Private typedef -----------------------------------------------------------*/
typedef struct
{
  uint8_t     PLM_F_len;
  uint8_t     PLM_F_Xmode;
  plm_flag_t  PLM_F_TXOK;
  plm_flag_t  PLM_F_RXOK;
  plm_flag_t  PLM_F_CommNotAllowed;
}PLM_NTWFlag_t;

/* Private define ------------------------------------------------------------*/
#define PLM_REG     0
#define PLM_DATA    1
#define PLM_LEN     2
#define PLM_BODY    3

#define HEADER_FRAME          0xC1
#define HEADER_WAKEUP_VALUE   0xAA
#define PL_HDR_SIZE           8       // Physical layer header size
#define DATAGRAM_MAX_LEN      (((PAYLOAD_SIZE + PLM_RESERVED_BYTES) * 2) + PL_HDR_SIZE)  // Max datagram value (248 bytes with user data len = 100 bytes)

/* HARDWARE INTERFACE DEFINITIONS */
void  _SPI_UIRQHandler(void);
void  _EXTI_UIRQHandler(void);

#if (PLM_SPI == 1)
  #define PLM_RXTX_Interrupt        SPI1_IRQHandler
#elif (PLM_SPI == 2)
  #define PLM_RXTX_Interrupt        SPI2_IRQHandler
#else
  #define PLM_RXTX_Interrupt        SPI3_IRQHandler
#endif

#define PLM_SCK_PIN_N     ((uint16_t)(GPIO_Pin_0 << PLM_SCK_PIN))
#define PLM_MISO_PIN_N    ((uint16_t)(GPIO_Pin_0 << PLM_MISO_PIN))
#define PLM_MOSI_PIN_N    ((uint16_t)(GPIO_Pin_0 << PLM_MOSI_PIN))
#define PLM_CDPD_PIN_N    ((uint16_t)(GPIO_Pin_0 << PLM_CDPD_PIN))
#define PLM_BU_PIN_N      ((uint16_t)(GPIO_Pin_0 << PLM_BU_PIN))
#define PLM_REGDATA_PIN_N ((uint16_t)(GPIO_Pin_0 << PLM_REGDATA_PIN))
#define PLM_RXTX_PIN_N    ((uint16_t)(GPIO_Pin_0 << PLM_RXTX_PIN))

#if (PLM_CDPD_PIN == 0)
  #define PLM_CDPD_Interrupt  EXTI0_IRQHandler
#elif (PLM_CDPD_PIN == 1)
  #define PLM_CDPD_Interrupt  EXTI1_IRQHandler
#elif (PLM_CDPD_PIN == 2)
  #define PLM_CDPD_Interrupt  EXTI2_IRQHandler
#elif (PLM_CDPD_PIN == 3)
  #define PLM_CDPD_Interrupt  EXTI3_IRQHandler
#elif (PLM_CDPD_PIN == 4)
  #define PLM_CDPD_Interrupt  EXTI4_IRQHandler
#elif (PLM_CDPD_PIN > 4) && (PLM_CDPD_PIN < 10)
  #define PLM_CDPD_Interrupt  EXTI9_5_IRQHandler
#else
  #define PLM_CDPD_Interrupt  EXTI15_10_IRQHandler
#endif

// SPI port
#define PLM_SPI_PORT_N      ((GPIO_TypeDef *) (GPIOA_BASE + ((GPIOB_BASE - GPIOA_BASE) * PLM_SPI_PORT)))
// CDPD port
#define PLM_CDPD_PORT_N     ((GPIO_TypeDef *) (GPIOA_BASE + ((GPIOB_BASE - GPIOA_BASE) * PLM_CDPD_PORT)))
// BU port
#define PLM_BU_PORT_N       ((GPIO_TypeDef *) (GPIOA_BASE + ((GPIOB_BASE - GPIOA_BASE) * PLM_BU_PORT)))
// REGDATA port
#define PLM_REGDATA_PORT_N  ((GPIO_TypeDef *) (GPIOA_BASE + ((GPIOB_BASE - GPIOA_BASE) * PLM_REGDATA_PORT)))
// RXTX port
#define PLM_RXTX_PORT_N     ((GPIO_TypeDef *) (GPIOA_BASE + ((GPIOB_BASE - GPIOA_BASE) * PLM_RXTX_PORT)))

/* Private variables ---------------------------------------------------------*/
SPI_TypeDef *   PLM_SPI_PERIPHERAL;
uint32_t        PLM_RCC_APBPeriph_SPI;

uint8_t         SPI_Buffer[DATAGRAM_MAX_LEN];
uint8_t         SPI_COMM_index;
uint32_t        SPI_MaxClockTime;
SPI_Mode_t      SPI_COMM_Mode;
PLM_NTWFlag_t   PLM_Flag;
uint16_t        SPI_MaxFrameCounter;
uint8_t         PLM_FEC_Corrections;
PLM_WP_TypeDef  PLM_WrongPostamble;
plmframe_t      PLMframe;
uint16_t        PLM_HeaderPreambleValue = HEADER_PREAMBLE_VALUE;

unsigned char LLucCRC[] = 
{
  0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
  0x00, 0x01, 0x00, 0x02, 0x00, 0x18, 0x00, 0x40,
  0x00, 0xc0, 0x03, 0x00, 0x00, 0x70, 0x04, 0x28,
  0x00, 0x01, 0x30, 0x1c, 0x00, 0x06, 0x80, 0x80,
  0x00, 0x10, 0x80, 0x80, 0x07, 0xa0, 0x00, 0x0a,
  0x00, 0x01, 0xe0, 0x02, 0x08, 0xc0, 0x50, 0x05,
  0x00, 0x0e, 0x03, 0x40, 0x60, 0x00, 0x38, 0x14,
  0x00, 0x01, 0x0c, 0x20, 0x00, 0x00, 0x00, 0x00
};

unsigned char tableFEC[] =
{
  0x3f, 0x06, 0x34, 0x0d, 0x29, 0x10, 0x22, 0x1b, 0x13, 0x2a, 0x18, 0x21, 0x05, 0x3c, 0x0e, 0x37, 
  0x1e, 0x27, 0x15, 0x2c, 0x08, 0x31, 0x03, 0x3a, 0x32, 0x0b, 0x39, 0x00, 0x24, 0x1d, 0x2f, 0x16, 
  0x04, 0x3d, 0x0f, 0x36, 0x12, 0x2b, 0x19, 0x20, 0x28, 0x11, 0x23, 0x1a, 0x3e, 0x07, 0x35, 0x0c, 
  0x25, 0x1c, 0x2e, 0x17, 0x33, 0x0a, 0x38, 0x01, 0x09, 0x30, 0x02, 0x3b, 0x1f, 0x26, 0x14, 0x2d, 
  0x30, 0x09, 0x3b, 0x02, 0x26, 0x1f, 0x2d, 0x14, 0x1c, 0x25, 0x17, 0x2e, 0x0a, 0x33, 0x01, 0x38, 
  0x11, 0x28, 0x1a, 0x23, 0x07, 0x3e, 0x0c, 0x35, 0x3d, 0x04, 0x36, 0x0f, 0x2b, 0x12, 0x20, 0x19, 
  0x0b, 0x32, 0x00, 0x39, 0x1d, 0x24, 0x16, 0x2f, 0x27, 0x1e, 0x2c, 0x15, 0x31, 0x08, 0x3a, 0x03, 
  0x2a, 0x13, 0x21, 0x18, 0x3c, 0x05, 0x37, 0x0e, 0x06, 0x3f, 0x0d, 0x34, 0x10, 0x29, 0x1b, 0x22, 
  0x21, 0x18, 0x2a, 0x13, 0x37, 0x0e, 0x3c, 0x05, 0x0d, 0x34, 0x06, 0x3f, 0x1b, 0x22, 0x10, 0x29,
  0x00, 0x39, 0x0b, 0x32, 0x16, 0x2f, 0x1d, 0x24, 0x2c, 0x15, 0x27, 0x1e, 0x3a, 0x03, 0x31, 0x08, 
  0x1a, 0x23, 0x11, 0x28, 0x0c, 0x35, 0x07, 0x3e, 0x36, 0x0f, 0x3d, 0x04, 0x20, 0x19, 0x2b, 0x12, 
  0x3b, 0x02, 0x30, 0x09, 0x2d, 0x14, 0x26, 0x1f, 0x17, 0x2e, 0x1c, 0x25, 0x01, 0x38, 0x0a, 0x33, 
  0x2e, 0x17, 0x25, 0x1c, 0x38, 0x01, 0x33, 0x0a, 0x02, 0x3b, 0x09, 0x30, 0x14, 0x2d, 0x1f, 0x26, 
  0x0f, 0x36, 0x04, 0x3d, 0x19, 0x20, 0x12, 0x2b, 0x23, 0x1a, 0x28, 0x11, 0x35, 0x0c, 0x3e, 0x07, 
  0x15, 0x2c, 0x1e, 0x27, 0x03, 0x3a, 0x08, 0x31, 0x39, 0x00, 0x32, 0x0b, 0x2f, 0x16, 0x24, 0x1d, 
  0x34, 0x0d, 0x3f, 0x06, 0x22, 0x1b, 0x29, 0x10, 0x18, 0x21, 0x13, 0x2a, 0x0e, 0x37, 0x05, 0x3c
};

/* Private macro -------------------------------------------------------------*/
/* Private function prototypes -----------------------------------------------*/
void        PLM_InitPLMVars(void);

