AlirezaSalehy/plNIC/Tests/PLMTest/Src/stm32f10x_plm.c
void        PLM_SPI_Idle(void);
void        PLM_TXSelect(void);
void        PLM_RXSelect(void);
void        PLM_REGSelect(void);
void        PLM_DATASelect(void);
void        PLM_WaitSPICLKLow(void);

plm_flag_t  PLM_CheckPostamble(uint8_t len);
uint8_t     PLM_CheckFEC(void);
plm_flag_t  PLM_CorrectFEC(uint8_t *byteRx, uint8_t *ucFecRx);


/* Private functions ---------------------------------------------------------*/

/*******************************************************************************
* Function Name  : PLM_InitPLMVars
* Description    : Initialize global PLM vars
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
void PLM_InitPLMVars(void)
{
}

/*******************************************************************************
* Function Name  : PLM_PeripheralInit
* Description    : Associate the micro peripherals and pins to the ST7540
* Input          : PLM peripheral initializing structure
* Output         : None
* Return         : None
*******************************************************************************/
void PLM_PeripheralInit(PLM_IntPriorityInitTypeDef *PLM_PeripInitStruct)
{
  SPI_InitTypeDef   SPI_InitStructure;
  GPIO_InitTypeDef  GPIO_InitStructure;
  NVIC_InitTypeDef  NVIC_InitStructure;
  EXTI_InitTypeDef  EXTI_InitStructure;
  
  PLM_InitPLMVars();  
  
  /* PLM peripheral device initialization */

  /* Enable PLM SPI clocks */
  RCC_APB2PeriphClockCmd(RCC_APB2Periph_AFIO | (RCC_APB2Periph_GPIOA << PLM_SPI_PORT), ENABLE);
  
  if (PLM_SPI == 1)
  {
    PLM_SPI_PERIPHERAL = SPI1;
    PLM_RCC_APBPeriph_SPI = RCC_APB2Periph_SPI1;
    RCC_APB2PeriphClockCmd(PLM_RCC_APBPeriph_SPI, ENABLE);
  }
  else if (PLM_SPI == 2)
  {
    PLM_SPI_PERIPHERAL = SPI2;
    PLM_RCC_APBPeriph_SPI = RCC_APB1Periph_SPI2;
    RCC_APB1PeriphClockCmd(PLM_RCC_APBPeriph_SPI, ENABLE);
  }
  else
  {
    PLM_SPI_PERIPHERAL = SPI3;
    PLM_RCC_APBPeriph_SPI = RCC_APB1Periph_SPI3;
    RCC_APB1PeriphClockCmd(PLM_RCC_APBPeriph_SPI, ENABLE);
    
  }
  
  if (PLM_SPI_PERIPHERAL == SPI1)
    NVIC_InitStructure.NVIC_IRQChannel = SPI1_IRQn;
  else if (PLM_SPI_PERIPHERAL == SPI2)
    NVIC_InitStructure.NVIC_IRQChannel = SPI2_IRQn;
  else
  {
#if defined (STM32F10X_HD) || (defined STM32F10X_HD_VL) || (defined STM32F10X_XL) || (defined STM32F10X_CL)
      NVIC_InitStructure.NVIC_IRQChannel = SPI3_IRQn;
#else
      // Could be an hardware fault if attempt to use SPI3 in a device which has no SPI3
      NVIC_InitStructure.NVIC_IRQChannel = 51;
#endif
  }
  
  /* Configure PLM SPI pins: SCK, MISO and MOSI */
  GPIO_InitStructure.GPIO_Pin = PLM_SCK_PIN_N | PLM_MISO_PIN_N | PLM_MOSI_PIN_N;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;
  GPIO_Init(PLM_SPI_PORT_N, &GPIO_InitStructure);

  /* Configure PLM functional pins */
  
  /* PLM CDPD_BIT, PLM BU_BIT */
  GPIO_InitStructure.GPIO_Pin = PLM_CDPD_PIN_N;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IPU;
  GPIO_Init(PLM_CDPD_PORT_N, &GPIO_InitStructure);
  
  GPIO_InitStructure.GPIO_Pin = PLM_BU_PIN_N;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IPU;
  GPIO_Init(PLM_BU_PORT_N, &GPIO_InitStructure);
  
  /* PLM REGDATA_BIT */
  GPIO_InitStructure.GPIO_Pin = PLM_REGDATA_PIN_N;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
  GPIO_Init(PLM_REGDATA_PORT_N, &GPIO_InitStructure);
  
  /* PLM RXTX_BIT*/
  GPIO_InitStructure.GPIO_Pin = PLM_RXTX_PIN_N;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
  GPIO_Init(PLM_RXTX_PORT_N, &GPIO_InitStructure);
  
  /* Configure and enable PLM SPI interrupt ----------------------------------*/
  // NVIC_InitStructure.NVIC_IRQChannel = PLM_SPI_IRQ; 
  NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = PLM_PeripInitStruct->PLM_SPI_PreemptyPriority;
  NVIC_InitStructure.NVIC_IRQChannelSubPriority = PLM_PeripInitStruct->PLM_SPI_SubPriority;
  NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
  NVIC_Init(&NVIC_InitStructure);
  
  /* PLM SPI configuration */ 
  SPI_InitStructure.SPI_Direction = SPI_Direction_2Lines_FullDuplex;
  SPI_InitStructure.SPI_Mode = SPI_Mode_Slave;
  SPI_InitStructure.SPI_DataSize = SPI_DataSize_8b;
  SPI_InitStructure.SPI_CPOL = SPI_CPOL_Low;
  SPI_InitStructure.SPI_CPHA = SPI_CPHA_1Edge;
  SPI_InitStructure.SPI_NSS = SPI_NSS_Soft;
  SPI_InitStructure.SPI_BaudRatePrescaler = SPI_BaudRatePrescaler_256;
  SPI_InitStructure.SPI_FirstBit = SPI_FirstBit_MSB;
  SPI_InitStructure.SPI_CRCPolynomial = 7;
  SPI_Init(PLM_SPI_PERIPHERAL, &SPI_InitStructure);
  
  /* Enable PLM SPI RXNE interrupt */
  SPI_I2S_ITConfig(PLM_SPI_PERIPHERAL, SPI_I2S_IT_RXNE, ENABLE);
  
  PLM_SPI_Idle();

  /* Enable the EXTI Interrupt (CD_PD) <!> GPIO_Pin_0...15 is considered equal to EXTI_Line0...15 */
  EXTI_InitStructure.EXTI_Mode = EXTI_Mode_Interrupt;
  EXTI_InitStructure.EXTI_Line = (uint32_t)(EXTI_Line0 << PLM_CDPD_PIN);
  EXTI_InitStructure.EXTI_Trigger = EXTI_Trigger_Falling;
  EXTI_InitStructure.EXTI_LineCmd = ENABLE;
  EXTI_Init(&EXTI_InitStructure);

  /* Configure the EXTI line handler priority */
  if (PLM_CDPD_PIN < 5)
    NVIC_InitStructure.NVIC_IRQChannel = (EXTI0_IRQn + PLM_CDPD_PIN);
  else if (PLM_CDPD_PIN < 10)
    NVIC_InitStructure.NVIC_IRQChannel = EXTI9_5_IRQn;
  else
    NVIC_InitStructure.NVIC_IRQChannel = EXTI15_10_IRQn;
  
  NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = PLM_PeripInitStruct->PLM_CDPD_PreemptyPriority;
  NVIC_InitStructure.NVIC_IRQChannelSubPriority = PLM_PeripInitStruct->PLM_CDPD_SubPriority;
  NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
  NVIC_Init(&NVIC_InitStructure);
  
  /* CDPD Interrupt definition */
  GPIO_EXTILineConfig(PLM_CDPD_PORT, (uint8_t)(PLM_CDPD_PIN));
}

/*******************************************************************************
* Function Name  : PLM_Init
* Description    : Initialize the PLM module
* Input          : PLM initializing structure
* Output         : None
* Return         : None
*******************************************************************************/
void PLM_Init(PLM_InitTypeDef *PLM_InitStruct)
{
  uint8_t   PLM_reg[6];
  uint8_t   i, nAtt;
  uint32_t  nTout;
  
  /* Parameters verification */
  assert_param(IS_PLM_FREQUENCY(PLM_InitStruct->PLM_BandpassFrequency));
  assert_param(IS_PLM_BAUDRATE(PLM_InitStruct->PLM_BaudRate));
  assert_param(IS_PLM_DEVIATION(PLM_InitStruct->PLM_Deviation));
  assert_param(IS_PLM_PREFILTER(PLM_InitStruct->PLM_PreFilter));
  
  /*--------------------------------------------------------------
    Registers configuration for ST7540
    --------------------------------------------------------------
  
