AlirezaSalehy/plNIC/Tests/PLMTest/Src/stm32f10x_plm.c
    +-------+--------+-------+
    | 0x93  |  0x90  |  0x17 |
    +-------+--------+-------+
    11110111 10010100 00010111 -> 0xF7 0x94 0x17
    |||||||| |||||||| ||||||||
    |||||||| |||||||| |||||+++- Frequency   : 132.5 KHz (default)
    |||||||| |||||||| |||++---- Baud Rate   : 2400 bps (default)
    |||||||| |||||||| ||+------ Deviation   : 0.5 (default)
    |||||||| |||||||| |+------- WatchDog    : Disabled
    |||||||| |||||||+ +-------- Tx Timeout  : Disabled
    |||||||| |||||++- --------- Freq D.T.   : 500 usec
    |||||||| ||||+--- --------- Reserved    : 0
    |||||||| ||++---- --------- Preamble    : With Conditioning
    |||||||| |+------ --------- Mains I.M.  : Synchronous
    |||||||+ +------- --------- Output Clock: Off
    ||||||+- -------- --------- Output V.L. : Off
    |||||+-- -------- --------- Header Rec. : Disabled
    ||||+--- -------- --------- Frame Len C.: Disabled
    |||+---- -------- --------- Header Len  : 16 bit
    ||+----- -------- --------- Extended Rgs: Enabled
    |+------ -------- --------- Sensitivity : Normal 
    +------- -------- --------- Input Filter: Enabled
  */
  
  /* Assign HEADER */
  PLM_HeaderPreambleValue = PLM_InitStruct->PLM_HeaderPreamble;
    
  /* Using Extended REGs */
  PLM_reg[0] = 0x01;
  PLM_reg[1] = (uint8_t)(PLM_InitStruct->PLM_HeaderPreamble >> 8);
  PLM_reg[2] = (uint8_t)(PLM_InitStruct->PLM_HeaderPreamble & 0x0FF);
  PLM_reg[3] = 0x37 | (uint8_t)(PLM_InitStruct->PLM_PreFilter)| (uint8_t)(PLM_InitStruct->PLM_Sensitivity);
  PLM_reg[4] = 0x94;
  PLM_reg[5] = (uint8_t)(PLM_InitStruct->PLM_BandpassFrequency & 0x07) | \
               (uint8_t)(PLM_InitStruct->PLM_BaudRate & 0x18) | \
               (uint8_t)(PLM_InitStruct->PLM_Deviation & 0x20);
  
  nAtt = 3; // Initialization attempts
  
  nTout = 0;
  while (nTout == 0)
  {
    /* Configuration Registers Transmission */
    PLM_WriteRegisters(PLM_reg, 6);
    nTout = 1000000;
    while((!PLM_Flag.PLM_F_TXOK)&&(nTout--));
    
    if (nTout)
    {
      /* Configuration Registers Verification */
      PLM_StartReadRegisters();
      
      nTout = 1000000;
      while((!PLM_Flag.PLM_F_RXOK)&&(nTout--));
      
      if (nTout)
      {
        for (i=0; i<6; i++)
        {
          if (PLM_reg[i] != SPI_Buffer[i])
          {
            nTout = 0;
            break;
          }
        }
      }
    }
    
    if (nTout == 0)
    {
      // Reset SPI clock bus
      SPI_Cmd(PLM_SPI_PERIPHERAL, DISABLE);
      if (PLM_SPI == 1)
        RCC_APB2PeriphResetCmd(PLM_RCC_APBPeriph_SPI, DISABLE);
      else
        RCC_APB1PeriphResetCmd(PLM_RCC_APBPeriph_SPI, DISABLE);
      if ((nAtt--) == 0)
      {
        // PLM hardware fault
        while(1);
      }
      if (PLM_SPI == 1)
        RCC_APB2PeriphResetCmd(PLM_RCC_APBPeriph_SPI, ENABLE);
      else
        RCC_APB1PeriphResetCmd(PLM_RCC_APBPeriph_SPI, ENABLE);
      nTout = 10000;
      while(nTout--);
      nTout = 0;
    }
  }
}

/*******************************************************************************
* Function Name  : PLM_FrameSent
* Description    : Get the frame sent flag
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
uint8_t PLM_FrameSent(void)
{
  return PLM_Flag.PLM_F_TXOK;
}

/*******************************************************************************
* Function Name  : PLM_CDPD_Interrupt
* Description    : Manage the CDPD interrupt line (falling edge)
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
void PLM_CDPD_Interrupt(void)
{
  if (EXTI_GetITStatus((uint32_t)(EXTI_Line0 << PLM_CDPD_PIN)) != RESET)
  {
    if (PLM_Flag.PLM_F_CommNotAllowed == PLM_FLAG_FALSE)
    {
      // Falling Edge of CD_PD: Frame recognition start
      SPI_Cmd(PLM_SPI_PERIPHERAL, DISABLE);
      SPI_COMM_index = 0;
      SPI_I2S_ReceiveData(PLM_SPI_PERIPHERAL);
      /* Enable PLM SPI */
      SPI_Cmd(PLM_SPI_PERIPHERAL, ENABLE);
    }
    /* Clear the EXTI Line */
    EXTI_ClearITPendingBit((uint32_t)(EXTI_Line0 << PLM_CDPD_PIN));
  }
  /* If user uses the same int pin of a CDPD line, user routine is not 
     served because the correspondent bit has already been cleared */
#if (PLM_CDPD_PIN > 4) && (PLM_CDPD_PIN <= 15)
  _EXTI_UIRQHandler();
#endif
}


/*******************************************************************************
* Function Name  : PLM_CorrectFEC
* Description    : Chect and eventually corrects the forward errors (FEC) for a 
                   specified byte
* Input          : Received byte pointer, received FEC pointer
* Output         : None
* Return         : None
*******************************************************************************/
plm_flag_t PLM_CorrectFEC(uint8_t *byteRx, uint8_t *ucFecRx)
{
  uint8_t synd;	
  uint8_t i;	
  uint8_t ucFecCalc;	
  
  *ucFecRx = ~(*ucFecRx);
  *ucFecRx = (*ucFecRx) & 0x3f;	
  ucFecCalc = ((*byteRx)>>1);

  if(ucFecCalc & 0x40)
    ucFecCalc ^= 0x39;

  ucFecCalc = ((ucFecCalc << 1) | ((*byteRx) & 0x01));

  if(ucFecCalc & 0x40)
    ucFecCalc ^= 0x39;
  
  for(i=0; i<6; i++)
  {
    ucFecCalc = (ucFecCalc<<1) | ((((*ucFecRx) >> (5 - i)) & 0x01));
    if(ucFecCalc & 0x40)
      ucFecCalc ^= 0x39;
  }

  synd = ucFecCalc;
  synd &= 0x3f;
  if(synd)
  {
    (*byteRx) ^= LLucCRC[synd];
    return PLM_FLAG_TRUE;
  }
  return PLM_FLAG_FALSE;
}

/*******************************************************************************
* Function Name  : PLM_RXTX_Interrupt 
* Description    : Manage the CDPD SPI interrupt routine (on CDPD)
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
void PLM_RXTX_Interrupt(void)
{
  // Transmission 
  if(SPI_I2S_GetITStatus(PLM_SPI_PERIPHERAL, SPI_I2S_IT_TXE) != RESET)
  {
    // End of transmission check 
    if(SPI_COMM_index == PLM_Flag.PLM_F_len)
    {
      /* Disable PLM SPI TXE interrupt */
      SPI_I2S_ITConfig(PLM_SPI_PERIPHERAL, SPI_I2S_IT_TXE, DISABLE);
      SPI_COMM_index++;
      return;
    }
    
    SPI_I2S_SendData(PLM_SPI_PERIPHERAL, SPI_Buffer[SPI_COMM_index++]);
  }
  
  // Reception
  if(SPI_I2S_GetITStatus(PLM_SPI_PERIPHERAL, SPI_I2S_IT_RXNE) != RESET)
  {
    // Reception
    if (SPI_COMM_Mode == SPI_TX_MODE)
    {
      // Read dummy byte and empty the register 
      SPI_I2S_ReceiveData(PLM_SPI_PERIPHERAL);
      if (SPI_COMM_index == (PLM_Flag.PLM_F_len+1))
      {
        SPI_COMM_index = 0;
        PLM_Flag.PLM_F_TXOK = PLM_FLAG_TRUE;
        PLM_SPI_Idle();
        SPI_COMM_Mode = SPI_HDR_MODE;
      }  
    }
    else
    {
      // Receiver or Header Mode
      SPI_Buffer[SPI_COMM_index++] = (uint8_t)SPI_I2S_ReceiveData(PLM_SPI_PERIPHERAL);
      
      if ((SPI_COMM_index == 1) && (PLM_Flag.PLM_F_Xmode == PLM_DATA))
      {
        if (SPI_Buffer[0] != HEADER_FRAME)
        {
          SPI_COMM_index = 0;
          PLM_SPI_Idle();
        }
        else
        {
          PLM_Flag.PLM_F_Xmode = PLM_LEN;
          // Header is filtererd
          SPI_COMM_index = 0;
          // Estimate the datalen. It will be tuned after
          SPI_MaxFrameCounter = DATAGRAM_MAX_LEN;
        }
      }
      
      // Read the datalen and check the FEC
      if ((SPI_COMM_index == 2) && (PLM_Flag.PLM_F_Xmode == PLM_LEN))
      {
        PLM_CorrectFEC(SPI_Buffer, (SPI_Buffer + 1));
        SPI_MaxFrameCounter = (SPI_Buffer[0] << 1) + 1; // payload + postamble byte
        SPI_COMM_index = 0;
        if (SPI_MaxFrameCounter > DATAGRAM_MAX_LEN)
        {
          PLM_Flag.PLM_F_Xmode = PLM_DATA;
          PLM_SPI_Idle();
          return;
        }
        PLM_Flag.PLM_F_Xmode = PLM_BODY;
      }
      
      // Verify the end of communication
      if (SPI_COMM_index > SPI_MaxFrameCounter)
      {
        PLM_Flag.PLM_F_len = ((SPI_MaxFrameCounter - 1) >> 1); // only payload len (without fec)
        PLM_Flag.PLM_F_CommNotAllowed = PLM_FLAG_TRUE;
        PLM_Flag.PLM_F_RXOK = PLM_FLAG_TRUE;
        PLM_SPI_Idle();
      }
    }
  }
}

