AlirezaSalehy/plNIC/Tests/PLMTest/Src/stm32f10x_plm.c
/*******************************************************************************
* Function Name  : PLM_SPI_Idle
* Description    : Sets the PLM in idle mode
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
void PLM_SPI_Idle(void)
{
  /* Disable PLM SPI */
  SPI_Cmd(PLM_SPI_PERIPHERAL, DISABLE);
  SPI_I2S_ITConfig(PLM_SPI_PERIPHERAL, SPI_I2S_IT_TXE, DISABLE);
  // Read dummy byte and empty the register 
  SPI_I2S_ReceiveData(PLM_SPI_PERIPHERAL);
  PLM_DATASelect();
  PLM_RXSelect();
}

/*******************************************************************************
* Function Name  : PLM_TXSelect
* Description    : TX mode
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
void PLM_TXSelect(void)
{
  GPIO_ResetBits(PLM_RXTX_PORT_N, PLM_RXTX_PIN_N);
}

/*******************************************************************************
* Function Name  : PLM_RXSelect
* Description    : RX mode
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
void PLM_RXSelect(void)
{
  GPIO_SetBits(PLM_RXTX_PORT_N, PLM_RXTX_PIN_N);
}

/*******************************************************************************
* Function Name  : PLM_REGSelect
* Description    : Register mode
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
void PLM_REGSelect(void)
{
  PLM_WaitSPICLKLow();
  GPIO_SetBits(PLM_REGDATA_PORT_N, PLM_REGDATA_PIN_N);
}

/*******************************************************************************
* Function Name  : PLM_DATASelect
* Description    : Data mode
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
void PLM_DATASelect(void)
{
  PLM_WaitSPICLKLow();
  GPIO_ResetBits(PLM_REGDATA_PORT_N, PLM_REGDATA_PIN_N);
}

/*******************************************************************************
* Function Name  : PLM_SendData
* Description    : Sends bytes through PLM 
* Input          : PLM mode, buffer pointer, buffer len, class value
* Output         : None
* Return         : None
*******************************************************************************/
void PLM_SendData(uint8_t *buffer, uint8_t len)
{
  uint16_t index = 0;
  
  PLM_Flag.PLM_F_CommNotAllowed = PLM_FLAG_TRUE;
  SPI_COMM_Mode = SPI_TX_MODE;
  PLM_Flag.PLM_F_TXOK = PLM_FLAG_FALSE;
  PLM_Flag.PLM_F_Xmode = PLM_DATA;
  
  // len will be doubled for FEC and added with the header size (10 bytes)
  PLM_Flag.PLM_F_len = (len << 1) + 10; 
  // HEDER
  SPI_Buffer[0] = HEADER_WAKEUP_VALUE; // 0xAA (1)
  SPI_Buffer[1] = HEADER_WAKEUP_VALUE; // 0xAA (2)
  SPI_Buffer[2] = HEADER_WAKEUP_VALUE; // 0xAA (3)
  SPI_Buffer[3] = HEADER_WAKEUP_VALUE; // 0xAA (4)
  SPI_Buffer[4] = (uint8_t)(PLM_HeaderPreambleValue>> 8); // (5)
  SPI_Buffer[5] = (uint8_t)(PLM_HeaderPreambleValue & 0x0FF); // (6)
  SPI_Buffer[6] = HEADER_FRAME; // (7)
  
  // Here is placed the frame length with the correspondent FEC
  SPI_Buffer[7] = len; // (8)
  SPI_Buffer[8] = tableFEC[len]; // (9)
  
  // Reset index
  index = 9;
  // DATA
  while(len--)
  {
    // Data
    SPI_Buffer[index++]= *(buffer++);
    // FEC
    SPI_Buffer[index] = tableFEC[SPI_Buffer[index-1]];
    index++;
  }
  
  // Postamble (10)
  if(SPI_Buffer[index-1] & 0x01)
    SPI_Buffer[index++] = 0x03;
  else 
    SPI_Buffer[index++] = 0x00;

  SPI_COMM_index = 1;
  
  PLM_DATASelect(); // REGDATA = 0
  PLM_TXSelect(); // Register TxRx reset to 0

  /* SPI sync */
  PLM_WaitSPICLKLow();
  
  /* Send byte through the PLM SPI peripheral */
  SPI_I2S_SendData(PLM_SPI_PERIPHERAL, SPI_Buffer[0]);
  /* Enable PLM SPI  */
  SPI_Cmd(PLM_SPI_PERIPHERAL, ENABLE);
  /* Enable PLM SPI TXE interrupt */
  SPI_I2S_ITConfig(PLM_SPI_PERIPHERAL, SPI_I2S_IT_TXE, ENABLE);
}

/*******************************************************************************
* Function Name  : PLM_WriteRegisters
* Description    : Sends register bytes through PLM SPI
* Input          : PLM mode, buffer pointer, buffer len, class value
* Output         : None
* Return         : None
*******************************************************************************/
void PLM_WriteRegisters(uint8_t *buffer, uint8_t len)
{
  uint16_t index = 0;
  
  PLM_Flag.PLM_F_CommNotAllowed = PLM_FLAG_TRUE;
  SPI_COMM_Mode = SPI_TX_MODE;
  PLM_Flag.PLM_F_TXOK = PLM_FLAG_FALSE;
  PLM_Flag.PLM_F_Xmode = PLM_REG; // Register access
  
  PLM_Flag.PLM_F_len = len;
  while(len--)
    SPI_Buffer[index++] = *(buffer++);

  SPI_COMM_index = 1;
  PLM_REGSelect(); // REGDATA = 1
  PLM_TXSelect(); // Register TxRx reset to 0

  /* SPI sync */
  PLM_WaitSPICLKLow();
  
  /* Send byte through the PLM SPI peripheral */
  SPI_I2S_SendData(PLM_SPI_PERIPHERAL, SPI_Buffer[0]);
  /* Enable PLM SPI  */
  SPI_Cmd(PLM_SPI_PERIPHERAL, ENABLE);
  /* Enable PLM SPI TXE interrupt */
  SPI_I2S_ITConfig(PLM_SPI_PERIPHERAL, SPI_I2S_IT_TXE, ENABLE);
}

/*******************************************************************************
* Function Name  : PLM_StartReceiveData 
* Description    : Reads bytes from PLM 
* Input          : PLM mode
* Output         : None
* Return         : None
*******************************************************************************/
void PLM_StartReceiveData(void)
{
  PLM_Flag.PLM_F_RXOK = PLM_FLAG_FALSE;
  PLM_Flag.PLM_F_Xmode = PLM_DATA;
  PLM_Flag.PLM_F_len = 0;

  SPI_COMM_index = 0;
  
  SPI_COMM_Mode = SPI_HDR_MODE;
  PLM_DATASelect();
  PLM_RXSelect(); // Register TxRx set to 1
  
  /* SPI sync */
  PLM_WaitSPICLKLow();
  PLM_Flag.PLM_F_CommNotAllowed = PLM_FLAG_FALSE;
}

/*******************************************************************************
* Function Name  : PLM_StartReadRegisters 
* Description    : Reads bytes from PLM 
* Input          : PLM mode
* Output         : None
* Return         : None
*******************************************************************************/
void PLM_StartReadRegisters(void)
{
  PLM_Flag.PLM_F_RXOK = PLM_FLAG_FALSE;
  PLM_Flag.PLM_F_Xmode = PLM_REG;
  PLM_Flag.PLM_F_len = 0;

  SPI_COMM_index = 0;
  SPI_COMM_Mode = SPI_RX_MODE;
  SPI_MaxFrameCounter = 6; // 6 registers 
  
  PLM_REGSelect(); // REGDATA = 1
  PLM_RXSelect(); // Register TxRx set to 1
  
  /* SPI sync */
  PLM_WaitSPICLKLow();

