AlirezaSalehy/plNIC/Tests/PLMTest/Src/stm32f10x_plm.c
  SPI_Cmd(PLM_SPI_PERIPHERAL, ENABLE);
}

/*******************************************************************************
* Function Name  : PLM_Reset
* Description    : Reset the PLM 
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
void PLM_Reset(void)
{
  PLM_Flag.PLM_F_CommNotAllowed = PLM_FLAG_TRUE;
  
  PLM_Flag.PLM_F_RXOK = PLM_FLAG_FALSE;
  PLM_Flag.PLM_F_TXOK = PLM_FLAG_FALSE;  
  
  SPI_COMM_index = 0;
  SPI_COMM_Mode = SPI_HDR_MODE;
  PLM_SPI_Idle();
}

/*******************************************************************************
* Function Name  : PLM_CheckPostamble
* Description    : Check if the arrived SPI buffer postamble is correct
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
plm_flag_t PLM_CheckPostamble(uint8_t len)
{
  uint8_t ln;
  
  ln = len << 1;
  PLM_WrongPostamble = PLM_POSTAMBLE_OK;
  if((SPI_Buffer[ln]==0x03) && ((SPI_Buffer[ln-1]&0x01)==0x01)) 
    return PLM_FLAG_TRUE;
  if((SPI_Buffer[ln]==0x00) && ((SPI_Buffer[ln-1]&0x01)==0x00)) 
     return PLM_FLAG_TRUE;
  PLM_WrongPostamble = PLM_POSTAMBLE_WRONG;
  return PLM_FLAG_FALSE;
}

/*******************************************************************************
* Function Name  : PLM_CheckFEC
* Description    : Check the FEC for the entire received frame
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
uint8_t PLM_CheckFEC(void)
{
   uint8_t nDtBytes, i;
   uint8_t FECCorrections = 0;

   //nDtBytes = SPI_Buffer[14];
   nDtBytes = PLM_Flag.PLM_F_len * 2;
   for (i = 0; i < nDtBytes; i = i + 2)
   {
    if (PLM_CorrectFEC((SPI_Buffer + i), (SPI_Buffer + i + 1)))
      FECCorrections++;
   }
   return FECCorrections;
}

/*******************************************************************************
* Function Name  : PLM_GetBufferLength
* Description    : Return a length of the arrived buffer
* Input          : None
* Output         : None
* Return         : Frame lenght (0 = frame not arrived)
*******************************************************************************/
uint8_t PLM_GetBufferLength(void)
{
  if (PLM_Flag.PLM_F_RXOK)
    return PLMframe.len;
  return 0;
}

/*******************************************************************************
* Function Name  : PLM_GetWrongPostamble
* Description    : Return if the last received frame has a wrong postamble
* Input          : None
* Output         : None
* Return         : Frame lenght (0 = frame not arrived)
*******************************************************************************/
PLM_WP_TypeDef PLM_GetWrongPostamble(void)
{
  return PLM_WrongPostamble;
}

/*******************************************************************************
* Function Name  : PLM_GetFECCorrections
* Description    : Return the last received frame corrections
* Input          : None
* Output         : None
* Return         : Number of corrections
*******************************************************************************/
uint8_t PLM_GetFECCorrections(void)
{
  return PLM_FEC_Corrections;
}

/*******************************************************************************
* Function Name  : PLM_GetReceivedBufferPointer
* Description    : Return the pointer to the arrived buffer
* Input          : None
* Output         : None
* Return         : Buffer pointer
*******************************************************************************/
uint8_t*  PLM_GetReceivedBufferPointer(void)
{
  return PLMframe.framebuffer;
}

/*******************************************************************************
* Function Name  : PLM_ValidFrameArrived
* Description    : Checks if a valid frame is arrived, removing FEC and postamble
* Input          : None
* Output         : None
* Return         : Frame lenght (0=frame not arrived or not valid)
*******************************************************************************/
uint8_t PLM_ValidFrameArrived(void)
{
  uint8_t i;  
  
  PLMframe.len = 0;
  
  if (PLM_Flag.PLM_F_RXOK)
  {
    // postamble verification
    if (PLM_CheckPostamble(PLM_Flag.PLM_F_len))
    {
      // FEC corrections (if any)
      PLM_FEC_Corrections = PLM_CheckFEC();
      // Frame len assignment
      PLMframe.len = PLM_Flag.PLM_F_len;
      // FEC removal, buffer load
      for(i = 0; i < PLMframe.len; i++)
        PLMframe.framebuffer[i] = SPI_Buffer[i<<1];
    }
    else
      PLM_StartReceiveData(); // Wrong Postamble
  }
  
  return PLMframe.len;
}


/*******************************************************************************
* Function Name  : PLM_FrameArrived
* Description    : Checks if any frame is arrived
* Input          : None
* Output         : None
* Return         : Frame lenght (0=frame not arrived or not valid)
*******************************************************************************/
uint8_t PLM_FrameArrived(void)
{
  return PLM_Flag.PLM_F_RXOK;
}

/*******************************************************************************
* Function Name  : PLM_BandInUse
* Description    : Checks if the band is in use
* Input          : None
* Output         : None
* Return         : FLAG_TRUE (band in use), FLAG_FALSE (band not in use)
*******************************************************************************/
uint8_t PLM_BandInUse(void)
{
  uint8_t i;
  uint8_t nBU = 0;
  
  for (i=0; i<10; i++)
  {
    if (GPIO_ReadInputDataBit(PLM_BU_PORT_N, PLM_BU_PIN_N) == 0x01) // BU check
      nBU++;
  }
  if (nBU > 7)
    return (PLM_FLAG_TRUE);
  else
    return (PLM_FLAG_FALSE);
}

/*******************************************************************************
* Function Name  : PLM_WaitSPICLKLow 
* Description    : Wait until SCK is low for PLM streaming syncronization
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
void PLM_WaitSPICLKLow(void)
{
//  u32 tout = 100000;
  
  while (GPIO_ReadInputDataBit(PLM_SPI_PORT_N, PLM_SCK_PIN_N)>0);
//  {
//    tout--;
//  }
}


/******************* (C) COPYRIGHT 2007 STMicroelectronics *****END OF FILE****/

